Tekla Open API Reference for Tekla Structures 2025
PluginSymbolVisiblityAttribute.Type Property
 Returns the type of the input object dependency.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginBase.SymbolVisibility Type { get; }
Public ReadOnly Property Type As PluginBase.SymbolVisibility
	Get
Property Value
Type: PluginBase.SymbolVisibility
See Also
Reference
PluginSymbolVisiblityAttribute Class
Tekla.Structures.Plugins Namespace